app/controllers/items_controller.rb

SELECT "products".* FROM "products"
---
  def new
    @products=Product.all

SELECT  "shoppinglists".* FROM "shoppinglists" WHERE "shoppinglists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "products".* FROM "products"
---
  def edit
    @shoppinglist= Shoppinglist.find(@item.shoppinglist_id)
    @products=Product.all

SELECT  "shoppinglists".* FROM "shoppinglists" WHERE "shoppinglists"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "items" ("product_id", "quantity", "shoppinglist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["product_id", 1], ["quantity", 10], ["shoppinglist_id", 1], ["created_at", "2016-01-23 18:06:35.768041"], ["updated_at", "2016-01-23 18:06:35.768041"]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "shoppinglists" SET "total" = ?, "updated_at" = ? WHERE "shoppinglists"."id" = ?  [["total", 1000.0], ["updated_at", "2016-01-24 11:22:13.649315"], ["id", 6]]
UPDATE "products" SET "quantity" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["quantity", 15015], ["updated_at", "2016-01-24 10:59:51.715684"], ["id", 1]]
---
  def create
    @shoppinglist = Shoppinglist.find(params[:shoppinglist_id])
    @item = @shoppinglist.items.create(item_params)
    p=Product.find(@item.product_id)
       if(current_user.m_type==0)
          p.quantity+=@item.quantity
        else
          p.quantity-=@item.quantity
        end
    @shoppinglist.total+=@item.quantity*p.price
    @shoppinglist.save
    p.save

SELECT  "shoppinglists".* FROM "shoppinglists" WHERE "shoppinglists"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "items" SET "product_id" = ?, "quantity" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["product_id", 1], ["quantity", 112], ["updated_at", "2016-01-24 07:22:39.550492"], ["id", 10]]
UPDATE "shoppinglists" SET "total" = ?, "updated_at" = ? WHERE "shoppinglists"."id" = ?  [["total", 2000.0], ["updated_at", "2016-01-24 11:30:24.422511"], ["id", 8]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 10]]
---
  def update
    shoppinglist=Shoppinglist.find(@item.shoppinglist_id)
    if(current_user.m_type==0)
      @p.quantity-=@item.quantity
    else
      @p.quantity+=@item.quantity
    end
    shoppinglist.total-=@item.quantity*@p.price
    shoppinglist.save
    respond_to do |format|
      if @item.update(item_params)
        if(current_user.m_type==0)
          @p.quantity+=@item.quantity
        else
          @p.quantity-=@item.quantity
        end
        shoppinglist.total+=@item.quantity*@p.price
        shoppinglist.save
        @p.save
        format.html { redirect_to Shoppinglist.find(@item.shoppinglist_id), notice: 'Item was successfully updated.' }

SELECT  "shoppinglists".* FROM "shoppinglists" WHERE "shoppinglists"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "shoppinglists" SET "total" = ?, "updated_at" = ? WHERE "shoppinglists"."id" = ?  [["total", 1000.0], ["updated_at", "2016-01-24 11:25:11.826948"], ["id", 6]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 3]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 3]]
---
  def destroy
    if(current_user.m_type==0)
      @p.quantity-=@item.quantity
    else
      @p.quantity+=@item.quantity
    end
    @shoppinglist= Shoppinglist.find(@item.shoppinglist_id)
    @shoppinglist.total-=@item.quantity*@p.price
    @shoppinglist.save
    @p.save
    @item.destroy
    respond_to do |format|
      format.html { redirect_to Shoppinglist.find(@item.shoppinglist_id), notice: 'Item was successfully destroyed.' }

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_item
      @item = Item.find(params[:id])
      @p=Product.find(@item.product_id)