app/controllers/manipulators_controller.rb

SELECT "manipulators".* FROM "manipulators"
---
  def index
    @manipulators = Manipulator.all

SELECT  "manipulators".* FROM "manipulators" WHERE "manipulators"."m_name" = ? AND "manipulators"."password" = ?  ORDER BY "manipulators"."id" ASC LIMIT 1  [["m_name", "123"], ["password", "12345"]]
---
  def do_login
  	puts  params[:username]
  	puts  params[:password]
    user = Manipulator.where(m_name: params[:m_name], password: params[:password]).first

INSERT INTO "manipulators" ("m_name", "password", "m_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["m_name", "123"], ["password", "12345"], ["m_type", 0], ["created_at", "2016-01-24 04:11:21.951063"], ["updated_at", "2016-01-24 04:11:21.951063"]]
---
  def create
    @manipulator = Manipulator.new(manipulator_params)

    respond_to do |format|
      if @manipulator.save

DELETE FROM "manipulators" WHERE "manipulators"."id" = ?  [["id", 980190962]]
---
  def destroy
    @manipulator.destroy

SELECT  "manipulators".* FROM "manipulators" WHERE "manipulators"."id" = ? LIMIT 1  [["id", 980190962]]
---
    def set_manipulator
      @manipulator = Manipulator.find(params[:id])