app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("p_name", "description", "price", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["p_name", "apple"], ["description", "fruit"], ["price", 20.0], ["quantity", 1000], ["created_at", "2016-01-23 17:56:59.942678"], ["updated_at", "2016-01-23 17:56:59.942678"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "description" = ?, "price" = ?, "quantity" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["description", "fruit"], ["price", 15.0], ["quantity", 1000], ["updated_at", "2016-01-23 17:57:28.515034"], ["id", 2]]