app/controllers/shoppinglists_controller.rb

SELECT  "shoppinglists".* FROM "shoppinglists" WHERE "shoppinglists"."manipulator_id" = ? LIMIT 1  [["manipulator_id", 1]]
---
  def index
    @shoppinglists = Shoppinglist.where(manipulator_id:current_user.id)

SELECT "products".* FROM "products"
SELECT  "shoppinglists".* FROM "shoppinglists" WHERE "shoppinglists"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
  	@i
  	@products=Product.all
    @shoppinglist = Shoppinglist.find(params[:id])

SELECT "products".* FROM "products"
SELECT  "manipulators".* FROM "manipulators" WHERE "manipulators"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "shoppinglists" ("time", "total", "manipulator_type", "manipulator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["time", "2016-01-24 09:27:12.850030"], ["total", 0.0], ["manipulator_type", 0], ["manipulator_id", 1], ["created_at", "2016-01-24 09:27:12.852053"], ["updated_at", "2016-01-24 09:27:12.852053"]]
---
  def new
  	@products=Product.all
    @shoppinglist = Shoppinglist.new
    @shoppinglist.time=Time.new
    @shoppinglist.total=0
    @shoppinglist.manipulator_type=Manipulator.find(current_user.id).m_type
    @shoppinglist.manipulator_id=current_user.id
    @shoppinglist.save

INSERT INTO "shoppinglists" ("manipulator_type", "total", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["manipulator_type", 0], ["total", 10.0], ["time", "2016-01-23 14:28:00.000000"], ["created_at", "2016-01-23 14:47:28.856477"], ["updated_at", "2016-01-23 14:47:28.856477"]]
---
  def create
    @shoppinglist = Shoppinglist.new(shoppinglist_params)

    respond_to do |format|
      if @shoppinglist.save

SELECT "items".* FROM "items" WHERE "items"."shoppinglist_id" = ?  [["shoppinglist_id", 10]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "products" SET "quantity" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["quantity", 14915], ["updated_at", "2016-01-24 11:16:41.801722"], ["id", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 17]]
DELETE FROM "shoppinglists" WHERE "shoppinglists"."id" = ?  [["id", 8]]
---
  def destroy
    unless @shoppinglist.items.nil?
    	@shoppinglist.items.each do |item|
    		p=Product.find(item.product_id)
    		if(current_user.m_type==0)
    		  p.quantity-=item.quantity
    		else
      		  p.quantity+=item.quantity
    		end
    		p.save
    		item.destroy
    	end
    end
    @shoppinglist.destroy

SELECT  "shoppinglists".* FROM "shoppinglists" WHERE "shoppinglists"."id" = ? LIMIT 1  [["id", 980190962]]
---
    def set_shoppinglist
      @shoppinglist = Shoppinglist.find(params[:id])